# General and index.html
title=UniVote
welcome=Willkomen bei UniVote
introtext=UniVote ist ein Internet-Wahlsystem f\u00fcr die Durchf\u00fchrung von Wahlen an Schweizer Hochschulen. Das System ist das Resultat einer mehrj\u00e4hrigen Forschungst\u00e4tigkeit an der Berner Fachhochschule. Der gesamte Quelltext und eine detaillierte Beschreibung des Systems sind auf der Projektseite zug\u00e4nglich.
goProject=Zur Projektseite
ideaTitle=Idee
instructionTitle=Kurzanleitung
instructionText=<p>Die Stimmabgabe mittels UniVote erfolgt in zwei Schritten:</p><ol><li>Zuerst registrieren Sie sich einmalig bei UniVote, am besten bereits vor Ihrer ersten Wahlteilnahme. Dabei erhalten Sie Ihren pers\u00f6nlichen Wahlschl\u00fcssel, der mit einem Passwort gesch\u00fctzt und von UniVote zertifiziert wird. Der passwortgesch\u00fctze Wahlschl\u00fcssel wird Ihnen per E-Mail zugestellt.</li><li>W\u00e4hrend der Wahlperiode erm\u00f6glicht Ihnen der pers\u00f6nliche Wahlschl\u00fcssel die anonyme und geheime Stimmabgabe. Nach erfolgreicher Stimmabgabe stellt Ihnen UniVote eine signierte Quittung der abgegebenen Stimme aus.</li></ol><p>Das Stimmgeheimnis und die Korrektheit der Wahl werden durch kryptographische Verfahren gesch\u00fctzt. Durch Ver\u00f6ffentlichung der kryptographisch gesch\u00fctzten Wahldaten kann das Wahlergebnis durch unabh\u00e4ngige Personen \u00fcberpr\u00fcft werden.</p>
goInstruction=Zur Kurzanleitung
registrationTitle=Registrierung
registrationText=F\u00fcr die einmalige Registrierung ben\u00f6tigen Sie die gew\u00f6hnlichen SWITCHaai-Zugangsdaten Ihrer Hochschule. Damit authentisieren Sie sich gegen\u00fcber UniVote als Angeh\u00f6rige oder Angeh\u00f6riger einer Schweizer Hochschule.
goRegister=Zur Registrierung
votingeventsTitle=Stimmabgabe
votingeventsText=F\u00fcr die Stimmabgabe ben\u00f6tigen Sie den pers\u00f6nlichen Wahlschl\u00fcssel, den Sie am Ende der Registrierung per E-Mail erhalten haben. Damit kann UniVote Ihre Wahlberechtigung pr\u00fcfen, ohne auf Ihre Identit\u00e4t schliessen zu k\u00f6nnen.
currentVotes=Aktuelle Wahlen
passedVotes=Abgeschlossene Wahlen
loadingElections=Aktuelle Wahldaten werden geladen...
noElections=Keine Wahldaten verf\u00fcgbar.
retreiveElectionDefinitionError=Fehler beim Laden der Wahldaten.
goVote=Zur Wahl

about=Berner Fachhochschule BFH

missingConfig=Fehler: Fehlende Konfiguration. Bitte melden.

cookieSupport=Cookies aktivieren
cookieSupportText=Bitte aktivieren Sie Cookies, um UniVote zu nutzen.

browsercheck1=Sie benutzen einen veralteten Browser!
browsercheck2=Es wird dringend empfohlen, den Browser zu aktualisieren.
browsercheck3=Bitte einer der folgenden Browser benutzen: Firefox 17+, Chrome 23+, Safari 6+ oder Internet Explorer 9+.
browsercheck4=Der verwendete Browser wird nicht unterst\u00fctzt.
processing=Bitte warten
loading=Seite wird geladen
close=Schliessen

goHelpBox=Support/Hilfe
helpBoxTitle=Support und Hilfe
helpBoxText=Haben Sie Fragen oder Anregungen? Oder funktioniert UniVote nicht so, wie es zu erwarten w\u00e4re? Dann z\u00f6gern Sie nicht und nehmen Sie mit uns Kontakt auf.
helpBoxEmail=Ihre E-Mail-Adresse
helpBoxMessage=Ihre Nachricht
helpBoxMessageAdds=Bei Problemen mit dem System bitten wir Sie, uns gleich mitzuteilen, welches Betriebssystem und welchen Browser Sie ben\u00fctzen.
helpBoxSubmit=Abschicken
helpBoxWait=Bitte warten Sie, das Formular wird \u00fcbermittlet...
helpBoxSuccess=Ihre Nachricht wurde uns erfolgreich zugestellt. Wir werden Sie in K\u00fcrze kontaktieren.
helpBoxError=Leider ist ein Fehler aufgetreten. Bitte versuchen Sie es noch einmal.

#registration.xhtml
certrequest=Zertifikat beantragen
userNotAuthorised=Sie haben sich noch nicht authentisiert. Bitte gehen Sie zur UniCert Startseite und authentisieren Sie sich zuerst.
dataRetrievalError=Keine Daten empfangen.
goBack=Zur\u00fcck
genkeysStep1=SWITCHaai
genkeysStep2=Schl\u00fcsselerzeugung
genkeysStep3=Best\u00e4tigung
genkeysStep2Text=Um sich bei UniCert zu registrieren, m\u00fcssen Sie nachfolgend Ihren pers\u00f6nlichen Schl\u00fcssel erstellen. Der Schl\u00fcssel ist eine zuf\u00e4llige Zeichenfolge, die lokal in Ihrem Browser erstellt wird. Anschliessend m\u00fcssen Sie den Schl\u00fcssel mit einem Passwort sch\u00fctzen, damit er Ihnen per E-Mail zugestellt werden kann.
genkeysSubstep21Text=Konfiguration w\u00e4hlen
genkeysSubstep22Text=Erzeugung des pers\u00f6nlichen Schl\u00fcssel
genkeysSubstep23Text=Schl\u00fcssel mittels Passwort sch\u00fctzen
genkeysSubstep24Text=Passwortgesch\u00fctzter Schl\u00fcssel an Ihre E-Mail Adresse zustellen
pleaseSelect=Bitte w\u00e4hlen
genkeysButton=Schl\u00fcssel erzeugen
yourVotingKeyLabel=Ihr pers\u00f6nlicher Schl\u00fcssel
retreiveSecretKey=E-Mail zustellen
to=an
andText=und
optionalMail=optionale Emailadresse
password=Passwort eingeben
retypePassword=Passwort wiederholen
createCertificateFailed=Das Zertifikate konnte nicht erstellt werden.
sendSecretKeyFailed=Die E-Mail mit Ihrem Schl\u00fcssel konnte nicht verschickt werden. Bitte probieren Sie es noch einmal.
missingValuePQG=Bitte Werte eingeben f\u00fcr Primzahlen P und Q und f\u00fcr Generator G.
pwdTooShort=Zu kurz (min. 6 Zeichen)

regsuccess=Ihr pers\u00f6nlicher Schl\u00fcssel wurde erfolgreich erzeugt und von UniCert zertifiziert. Die E-Mail mit Ihrem passwortgesch\u00fctzen Schl\u00fcssel wurde verschickt. Diesen Schl\u00fcssel werden Sie in der Applikation wof\u00fcr er erstellt wurde ben\u00f6tigen, bewahren Sie diesen daher sicher auf.
inspectcert=Das Zertifikat Ihres Schl\u00fcssel wird von UniCert verwaltet. Optional k\u00f6nnen Sie das Zertifikat anschauen und herunterladen.
savecert=Zertifikat anschauen
backhome=Zur\u00fcck zur Startseite

yourCertificate=Das Zertifikat Ihres Schl\u00fcssels
certDownload=Herunterladen
# Certificate labels -> don't translate
certCanonicalName=Canonical Name
certOrganization=Organization
certOrganizationUnit=Organizational Unit
certIssuer=Issuer
certSerialNumber=Serial Number
certValidFrom=Valid From
certValidUntil=Valid Until
certFpSha1=Fingerprint
certPem=Certificate

pleaseSelectOption=Bitte eine Option ausw\u00e4hlen
manually=Manuell
keytype=Schl\u00fcsseltyp
keysize=Schl\u00fcssell\u00e4nge
valuep=Primzahl P
valueq=Primzahl Q
valueg=Generator G

application=Applikation
role=Rolle
voterCert=W\u00e4hler
tallierCert=Tallier
mixerCert=Mixer
electionAdminCert=Wahl Administration

identityFunction=Identit\u00e4t Bearbeitungsfunktion
idFStandardSwitch=Standard Funktion f\u00fcr SwitchAAI
idFAnonymizedSwitch=Anonymisierte Funktion f\u00fcr SwitchAAI
idFZurichSwitch=Z\u00fcrich Funktion f\u00fcr SwitchAAI
idFStandardGoogle=Standard Funktion f\u00fcr Google
idFAnonymizedGoogle=Anonymisierte Funktion f\u00fcr Google

switchConnectionSuccessTitle=SwitchAAI Login erfolgreich
switchConnectionSuccessText=Sie haben sich erfolgreich mit SwitchAAI eingeloggt. Sie werden in einige Sekunden weitergeleitet.

error100=Sie haben sich noch nicht authentisiert. Bitte gehen Sie zur UniCert Startseite und authentisieren Sie sich zuerst.
error101=Fehlende Argumente. Ungen\u00fcgende Daten wurden zum Server geschickt.
error102=Unbekannter Identity provider ausgew\u00e4hlt
error111=Server Fehler.
error120=Unbekannte Identit\u00e4t Bearbeitungsfunktion.
error121=Wichtige Identit\u00e4tdaten fehlen. Unm\u00f6glich CommonName zu initialisieren.
error122=Problem w\u00e4hrend dem Anonymisieren.
error123=Die ausgew\u00e4hlte Identit\u00e4t Bearbeitungsfunktion ist inkompatibel mit den Daten vom Identity Provider.
error124=Wichtige Identit\u00e4tdaten fehlen. Unm\u00f6glich UniqueId zu initialisieren.
error125=Die Emailadresse wurde vom identity provider nicht verifiziert.
error130=Kryptographischen Fehler.
error131=Unbekannter Schl\u00fcsseltyp.
errorundefined=Bitte \u00fcberpr\u00fcfen Sie Ihre Internetverbindung und probieren Sie es erneut.

error200=Server Fehler.
error211=Unbekannte Rolle.
error221=Ung\u00fcltige kryptographischen Werte: Minimalgr\u00f6sse nicht respektiert.
error222=Ung\u00fcltige Signatur.
error223=Ung\u00fcltiger Beweis.
error224=Inkompatibel kryptographischen Werte.
error230=Genereller Zertifikaterstellungsfehler.

#sendSecretKey
skMailSuccess=Die E-Mail wurde erfolgreich verschickt.
skMailSubject=Ihr UniCert Schl\u00fcssel
skMailBody=Guten Tag\n\nSie haben sich erfolgreich bei UniCert registriert!\n\nWeiter unten sehen Sie Ihren passwortgesch\u00fctzten Schl\u00fcssel f\u00fcr Applikation {0} und Rolle {1}. Im Anhang finden Sie das dazugeh\u00f6rige Zertifikat (authentisiert durch {2}). Diesen Schl\u00fcssel werden Sie in der Applikation wof\u00fcr er erstellt wurde ben\u00f6tigen. Bitte bewahren Sie diese E-Mail sorgf\u00e4ltig auf und merken Sie sich Ihr Passwort.\n\nMit besten Gr\u00fcssen\n\nDie UniCert-Registrierungsstelle


#vote.xhtml
retreiveElectionDataError=W\u00e4hrend dem Laden der Daten ist ein Fehler aufgetreten. Bitte \u00fcberpr\u00fcfen Sie Ihre Internetverbindung und probieren Sie es erneut.
signatureError=Die empfangenen Daten sind besch\u00e4digt. Bitte versuchen Sie die Seite neu zu laden.
incompatibleDataReceived=Inkompatible Daten empfangen. Bitte versuchen Sie die Seite neu zu laden. Kontaktieren Sie den Support falls der Fehler wieder auftritt.
voteStep1=Schl\u00fcsseleingabe
voteStep2=Abstimmung
voteStep3=Best\u00e4tigung
enterKey1=Zur \u00dcberpr\u00fcfung Ihrer Wahlberechtigung m\u00fcssen Sie den passwortgesch\u00fctzen Wahlschl\u00fcssel eingeben.
enterKey2=Der Wahlschl\u00fcssel wurde Ihnen w\u00e4hrend der Registrierung per E-Mail zugestellt
noKey1=Wenn Sie keinen Wahlschl\u00fcssel haben, dann
noKey2=registrieren
noKey3=Sie sich bitte zuerst.
yourKey=Ihr pers\u00f6nlicher Wahlschl\u00fcssel
yourKeyManually=Bitte vollst\u00e4ndigen Wahlschl\u00fcssel mittels copy/paste ins Textfeld einf\u00fcgen
yourPassword=Ihr Passwort
browse=Browse
continueStr=Zur Abstimmung
fileOrPwMissing=Bitte w\u00e4hlen Sie das File mit Ihrem Wahlschl\u00fcssel aus und geben Sie Ihr Passwort ein.
filemanuallyOrPwMissing=Bitte Wahlschl\u00fcssel und Passwort eingeben!
invalidUploadedKey=Ihr Wahlschl\u00fcssel ist ung\u00fcltig!
wrongPassword=Falsches Passwort!
wrongPasswordInvalidKey=Falsches Passwort oder ung\u00fcltiger Wahlschl\u00fcssel!
noAuthorizationFound=Sie sind nicht berechtigt abzustimmen. Sie werden also keine Stimme abschicken k\u00f6nnen.
errorAuthorizationVerification=Die \u00dcberpr\u00fcfung der Berechtigung ist fehlgeschlagen. Es k\u00f6nnte also sein, dass Sie keine Stimme abschicken werden k\u00f6nnen.

voteText=Bitte f\u00fcllen Sie Ihren Stimmzettel aus, indem Sie aus der linken Spalte Ihre gew\u00fcnschte Liste und die bevorzugten Kandidierenden auf den Stimmzettel ziehen. Sobald der Stimmzettel komplett ist, schicken Sie ihn bitte ab.
voteTextCandidatesOnly=Bitte f\u00fcllen Sie Ihren Stimmzettel aus, indem Sie aus der linken Spalte Ihre bevorzugten Kandidierenden auf den Stimmzettel ziehen. Sobald der Stimmzettel komplett ist, schicken Sie ihn bitte ab.
candidates=Kandidierende
ballot=Stimmzettel
list=Liste
candidate=Kandidierende
semester=Semester
previous=bisher
submitvote=Abschicken
add=Hinzuf\u00fcgen
remove=Entfernen
undo=R\u00fcckg\u00e4ngig
redo=Wiederherstellen
reset=Zur\u00fcckstellen
confirm=Best\u00e4tigen
copyCandidatesTitle=Alle Kandidierende kopieren
copyCandidates=M\u00f6chten Sie mit der Listennummer auch alle Kandidierenden kopieren?
removeCandidatesTitle=Kandidierende l\u00f6schen
removeCandidates=Sollen nebst der Listennummer auch die Kandidierenden entfernt werden?
error=Fehler
information=Information
tooManyCandidates=Der Stimmzettel ist voll, es k\u00f6nnen keine weiteren Kandidierende hinzugef\u00fcgt werden.
tooManyRepetitions=Die oder der Kandidierende kann nicht weiter kumuliert werden.
listcopiedwithmodif=Die Liste wurde kopiert, jedoch mussten Anpassungen vorgenommen werden, da die Liste nicht den Regeln entspricht.
demo=Demo
ok=OK
yes=Ja
no=Nein
skip=Schliessen
copyAllCandidates=Alle Kandidierende kopieren
copyListnumber=Nur Listennummer kopieren
incorRectresult=Ihr Stimmzettel ist fehlerhaft. Bitte korrigieren Sie Ihren Stimmzettel.
emptyResult=Ihr Stimmzettel ist nicht vollst\u00e4ndig. Bitte f\u00fcllen Sie den Stimmzettel vollst\u00e4ndig aus.
cancel=Abbrechen
noListShort=Keine Liste
noListLong=Sie haben keine Liste gew\u00e4hlt
wait=Bitte warten

sendVoteSuccess=Ihre Stimme wurde erfolgreich empfangen und von UniVote signiert. Die signierte Stimme sehen Sie unten in Form eines QR-Codes. Sie k\u00f6nnen den QR-Code ausdrucken, abspeichern oder mit Ihrem Smartphone fotografieren oder einlesen. Dieser dient Ihnen als Quittung f\u00fcr die erfolgreiche Wahlteilnahme.

sendVoteErrorInternalServerError=Ihre Stimme konnte wegen eines Fehlers nicht entgegengenommen werden. Bitte versuchen Sie es noch einmal.
sendVoteErrorInvalidSignatureError=Ihre Stimme konnte nicht richtig signiert werden. Bitte versuchen Sie es noch einmal.
sendVoteErrorInvalidElectionState=Sie befinden sich ausserhalb der Wahlperiode. Zur Zeit k\u00f6nnen f\u00fcr diese Wahl keine Stimmen entgegengenommen werden.
sendVoteErrorNoEligibleVoter=Sie sind nicht berechtigt, an dieser Wahl teilzunehmen. Ihre Stimme wird daher nicht ber\u00fccksichtigt.
sendVoteErrorAllreadyVoted=Sie haben bereits gew\u00e4hlt. Nur Ihre erste Stimme wird ber\u00fccksichtigt und ins Wahlresultat einfliessen.
sendVoteErrorVerificationKeyRevoked=Der benutzte Wahlschl\u00fcssel ist nicht mehr g\u00fcltig. Verwenden Sie bitte Ihren aktuellen Wahlschl\u00fcssel.

feedbackText=Bitte helfen Sie uns, UniVote weiter zu verbessern. Dazu ben\u00f6tigen wir Ihr Feedback!
feedbackLink=Zum Feedback-Formular
